// Валкана низа која што содржи различни типови на елементи, вклучувајќи и недефинирани вредности.Валкана
// Недефинирани вредности како : null, undefined
// Да се креира нова низа каде што ке се сместат само валидните вредности
// Пример dirtyArr = [ 1, "test",null, 2, 4,undefined] ===> cleanArr = [1, "test", 2,4]
// На крај, новата низа да се испечати

let dirtyArr = [1, "test", null, 2, 4, undefined];
let cleanArr = [];

for (let i = 0; i < dirtyArr.length; i++) {
  //
  // Се проверува дали елементот е валиден, доколку да тогаш поминува. Доколку не тогаш останува во валканата низа
  //
  // if (dirtyArr[i]) ---> Провери дали оваа променлива има валидна вредност
  if (dirtyArr[i]) {
    cleanArr.push(dirtyArr[i]);
  }
}

console.log(cleanArr);
