// Циклуси / Јамки (Loops)

// Кодот се извршува одново и одново се додека не биде прекинат

// for (uslov === true){

// }

// Ке направи loop еднаш, ке го зголеми „а“ за х2. Потоа, пак ке помине уште еднаш повторно ке го зголеми „а“ овој пат а ке биде х3. Пак уште еднаш ке помине ке го зголеми повторно „а“ за уште еднаш. И тогаш веке „а“ ке биде поголемо од „b“ и дури тогаш ке покаже Done!
let a = 1;
let b = 3;

while (a < b) {
  const ime = "Jhonny";
  console.log(ime);

  a++;

  console.log("Done!");
}
